[
  {
    "id": 1,
    "title": "Adam Joof: Fighting It Together",
    "image": "/assets/img/stories/adam-joof.jpg",
    "excerpt": " 1 in 10 women will be diagnosed with breast cancer in her lifetime. Behind every number is mother, sister, or a friend...",
    "link": "adam-joof-story",
    "fullText": "\"THE FIRST DAY I WAS DIAGNOSED WITH BREAST CANCER\" 1 in 10 women will be diagnosed with breast cancer in her lifetime. Behind every number is mother, sister, or a friend. Feelings are something you have, not something you are.i believe good times will come,life always offers you a second chance _ its called tomorrow. Don't look back you are not going that way. We believe in being strong when everything seems to be going wrong.you grow through what you go through. Life itself is a game , but don't let it win you. The journey may have been tough , but you are tougher.the battle may have been long but you are stronger.the scars may still be there , but they are a reminder of your bravery, your resilence, and your unwavering determination to live life to the fullest. Pink isn't just a colour , it's a movesment. For every life we honour , for every fight we face, we turn pink into purpose and courage into grace. Fight like a woman, win like a warrior. \"WHY FACE BREAST CANCER ALONE WHEN WE CAN FIGHT IT TOGETHER\""
  },
  {
    "id": 2,
    "title": "Adama Fadiya: A Story of Survival",
    "image": "/assets/img/stories/adama-fadiya-2.jpg",
    "excerpt": "Even when my strength begins to fade, I find the courage to rise again with renewed hope...",
    "link": "adama-fadiya-2-story",
    "fullText": "Even when my strength begins to fade, I find the courage to rise again with renewed hope. Every scar I carry is a powerful story of survival, reminding me of the battles I have fought and won. Each day that I wake up and face the world is a victory over fear and doubt. I am more than my challenges_ I am a warrior, resilient and unstoppable"
  },
  {
    "id": 3,
    "title": "Adama Fadiya: A New Kind of Courage",
    "image": "/assets/img/stories/adama-fadiya.jpg",
    "excerpt": "...it felt like my whole world collapsed.  It started with a small lump I almost ignored, followed by a strange...",
    "link": "adama-fadiya-story",
    "fullText": "The first day I was diagnosed with breast cancer, it felt like my whole world collapsed. It started with a small lump I almost ignored, followed by a strange fatigue and a tight pain I couldn't explain. I tried to convince myself it was nothing, but deep down, I was scared. When the diagnosis came, I was overwhelmed with fear and confusion. I didn't know who to talk to or where to begin. I worried about being judged, about how people would see me — like I was suddenly fragile or broken. The silence around me felt louder than the news itself. But in time, I found strength in the most unexpected places — in quiet support, kind words, and even in my own tears. That first day didn't break me. It opened the door to a new kind of courage I never knew I had."
  },
 
  {
    "id": 7,
    "title": "Aja Bintou Manneh: A Quiet Victory",
    "image": "/assets/img/stories/aja-bintou-manneh-1.jpg",
    "excerpt": "Some days, the pain feels endless—like a shadow that won't lift. But I choose to stand tall, not because it's easy, but because giving up was never an option...",
    "link": "aja-bintou-manneh-1-story",
    "fullText": "Some days, the pain feels endless—like a shadow that won't lift. But I choose to stand tall, not because it's easy, but because giving up was never an option. Every breath I take is a quiet victory, a reminder that I'm still here. Every scar on my body is not a flaw, but a page in the story of my survival. I may have been broken, reshaped, and tested, but I rise each day with grace, strength, and a heart that refuses to quit. I am more than what breast cancer tried to take—I am what it could never touch: my courage, my will, and my light."
  },
  {
    "id": 8,
    "title": "Ebee Ngum: We're In This Together",
    "image": "/assets/img/stories/ebee-ngum.jpg",
    "excerpt": "“The day I was diagnosed with breast cancer”, Everything changed but so did the love, care, and support that followed...",
    "link": "ebee-ngum-story",
    "fullText": "“The day I was diagnosed with breast cancer”, Everything changed but so did the love, care, and support that followed. It reminded me how powerful connection and love truly is. That's why I've made a promise to stand with every fighter, every survivor, and every soul touched by this battle. You'll never face it alone. We're in this together now, always, and all the way through."
  },
  {
    "id": 9,
    "title": "Aja Bintou Manneh: Don't Ignore the Signs",
    "image": "/assets/img/stories/aja-bintou-manneh-2.jpg",
    "excerpt": "“ i thought it was over , in my head it meant DEATH because that's all I ever heard about it. But...",
    "link": "aja-bintou-manneh-2-story",
    "fullText": "“THE FIRST DAY I WAS DIAGNOSED WITH BREAST CANCER” i thought it was over , in my head it meant DEATH because that's all I ever heard about it. But here's what they don't tell you, breast cancer doesn't mean the END! It means you have found a new purpose to fight, it means you learn, it means you discover your inner strength. Many young women just like me thought it would never happen to us, we thought it was just for the oldies but the signs were always there the pain I ignored, the lump which I thought was normal , the swelling I thought was pre-menstural syptoms all those changes I choose to ignore until I couldn't anymore. The first day I was diagnosed with breast cancer I felt broken, but today I stand because early detection saves lives! Beacause i'm not ALONE! Neither are you, know the signs, don't ignore the littles changes , go for SCREENINGS! You are stronger than you think WARRIOR! “WHY FACE BREAST CANCER ALONE WHEN WE CAN FIGHT IT TOGETHER”"
  },
  {
    "id": 10,
    "title": "Awa Njie: Stronger Than This",
    "image": "/assets/img/stories/awa-njie.jpg",
    "excerpt": "Everything in my life changed in an instant. I became a shadow of who I used to be haunted by fear. Fear of...",
    "link": "awa-njie-story",
    "fullText": "\"THE FIRST DAY I WAS DIAGNOSED WITH BREAST CANCER\" Everything in my life changed in an instant. I became a shadow of who I used to be haunted by fear. Fear of what people might say, fear of being treated differently, fear of being pushed aside and forgotten. So, I stepped away from everything I once dreamed of. I gave up. I wanted nothing more than to disappear from this world. But guess what? God had other plans. A quiet voice within whispered, “If God brought you this far, then trust He has something greater ahead. Don't give up. You are stronger than this.\" That moment sparked a new fire in me. I began to dream again, to live again. Today, I stand as a proud, successful entrepreneur, still fighting breast cancer after more than 15 years. To anyone facing this battle: Never stop believing in yourself. Keep your dreams alive. “If God brought you this far, know He has great plans for you. Don't give up you are stronger than this.”"
  },
  
  {
    "id": 13,
    "title": "THEPLUG: Hope Lives On",
    "image": "/assets/img/stories/the-plug.jpg",
    "excerpt": "To those fighting breast cancer, to the survivors who fought and won, and to the loved ones who stood beside them—your courage lights the world...",
    "link": "the-plug-story",
    "fullText": "To those fighting breast cancer, to the survivors who fought and won, and to the loved ones who stood beside them—your courage lights the world. You are the reason hope lives on."
  },
  {
    "id": 14,
    "title": "Marie Louise Mamo Jatta: Cancer Free",
    "image": "/assets/img/stories/marrie-louise-mamo-jatta.jpg",
    "excerpt": "I felt something in my breast and it pierced through my chest and the pain was persistent, my fears were rising and the results came out making me anxious...",
    "link": "marrie-louise-mamo-jatta-story",
    "fullText": "I felt something in my breast and it pierced through my chest and the pain was persistent ,my fears were rising and the results came out making me anxious I said to myself “breast cancer no it can’t be “ but through it all I fought strong and here I am today cancer free, if I did it you can do it too. #ACANCERFREENATION"
  },
  {
    "id": 15,
    "title": "Jankey Nije: Living a Full Life",
    "image": "/assets/img/stories/jankey-njie-2.jpg",
    "excerpt": "The goal is to live a full, productive life even with all that ambiguity...",
    "link": "jankey-njie-2-story",
    "fullText": "The goal is to live a full, productive life even with all that ambiguity. No matter what happens, whether the cancer never flares up again or whether you die, the important thing is that the days that you have had you will have lived."
  },
  {
    "id": 16,
    "title": "Jankey Nije: Caregiving is a Mindset",
    "image": "/assets/img/stories/jankey-njie.jpg",
    "excerpt": "THE DAY I WAS DIAGNOSED WITH BREAST CANCER “ I used to believe caregiving was something you offered others; acts of love, sacrifice, and nurturing directed outward...",
    "link": "jankey-njie-story",
    "fullText": "THE DAY I WAS DIAGNOSED WITH BREAST CANCER “ I used to believe caregiving was something you offered others; acts of love, sacrifice, and nurturing directed outward. But that day changed everything. I had to learn how to show up for myself. I had to learn how to hold space for my fear without letting it break me. The kindness I once reserved for others, I had to mirror in the quiet moments when pain was loud and hope felt distant. Every pill, every visit, every tear; I treated them like steps toward healing, not just surviving. And while many offered their strength to me, it was in the stillness of my own reflection that I realized: Caregiving isn’t just an act. It’s a mindset. It’s the promise to keep loving ;ourselves and others; through all the uncertain tomorrows."
  }

]